1. 要件定義(要求仕様書)<br>
<?php
    echo "システム開発を行う上で「どうシステム化するのか」を決める
    のが要件定義です。システム開発は、ユーザーが求める要求を要件へ落とし込む
    ところから始まります。要求定義と要件定義は違うものです。
    それぞれはドキュメントという形で残させれるのが一般的です。要件定義とは、
    クライアントの要望と、その要望をどのように叶えるのかを文章としてまとめたものです。<br>
    プロジェクトは、例えば、ウォータフォール型開発であれば、要件定義→
    設計→製造・テスト→導入の順で進められます。
    要件定義ができなければ、プロジェクトはスタートしないと言っても過言ではありません。
    要件定義の最終的な成果物は要件仕様書と呼ばれる書類です。要件仕様書とは、実装する機能など
    の整理した情報をクライアントに提出するために開発側が記述するものです。
    システムを実際に開発する前に提出する書類なので、実装予定の機能についてできる限り
    詳細に記入しなければいけません。作成目的はクライアントに対する説明です。
    要件定義とは、発注したユーザーの希望、要望を明らかにし、実装すべき機能や
    性能を明文化することです。逆に要求定義とは、ユーザーの希望、要望を聞き取り、
    システムエンジニアが文書化したものです。これが要求仕様書です。要件定義の一つ前段階の作業となります。
    ". '<br><br>';
    ?>
2. 単体テスト・結合テスト<br>
<?php
    echo "システム開発プロジェクトで「テスト計画」は避けて通ることはできないです。
    システム開発では主に、3つのテスト工程があります。それが、単体テスト、結合テスト、
    総合テスト（システムテスト）です。テスト計画では、これらの各テスト工程で、どのような
    ことを実装するのかを書きます。各テストの違いとしては、テスト範囲が違う。
    単体テストは単体機能、結合テストは機能間・他システム間、総合テストは構築したシステム全体
    （非機能も含む）。例えば、単体テストは画面1つ。結合テストは、画面間のデータ連携だったり、
    画面からバッチを起動する場合のデータ連携だったり、システムAとシステムBのバッチ間連携だったり。
    総合テストは、開発したシステム全体について要件を満足していることを検証する。". '<br><br>';
    ?>
3. テスト仕様書(どのようなもの、項目)<br>
<?php
    echo "テスト仕様書とは、システムやソフトウェアが、クライアントのヒアリングを基に
    作り上げた要件定義書の通りに機能するかどうか、テストするポイントをまとめたドキュメントです。<br>
    テスト仕様書で必要な項目リストとして<br>
    １、テストを実施した環境を記述<br>
    ２、実施するテストの内容<br>
    ３、テストを実施するためのシステムの操作手順<br>
    ４、テストの実行結果<br>
    ５、ここのテスト項目を識別するための番号や記号<br>
    ６、テストを実施した年月日<br>
    ７、テストを実行した担当者<br>
    ８、傷害報告番号<br>";
    ?>