<?php
echo "＜IT用語　エンジニアになって困らないための基本用語＞" . '<br>' . '<br>';
echo "1.トランザクション" . '<br>';
echo "トランザクションとは複数の処理を一つにまとめたもの。
    ただし、これら複数の処理は分離させることはできない。
    実行した結果は、成功か失敗のいずれかである。トランザクションの中の
    一連処理が全て成功したのちコミットすることで処理内容を反映させます。
    一方で、トランザクションの中の一連の処理のうち、どこかがうまくいかなかったら
    ロールバックすることでトランザクション実行前の状態に戻ります。
    トランザクションの例：銀行口座の口座振り込み" . '<br>' . '<br>';
echo "2.排他ロック" . '<br>';
echo "排他ロックとは、データベースシステムなどで、記憶領域への同時アクセスを
    同時アクセスを制限するロック機構の一つで、他の実行主体によるアクセスを完全に
    禁止するもの。
    あるトランザクションが実行中の時に、そのトランザクションが対象としているデータ
    をロックし、他のトランザクションのアクセスを禁止することによって、
    データの整合性を確保しようとする仕組み。
    トランザクションが完了すれば、ロックは解除され、他のトランザクションはデータに
    アクセスできるようになる。" . '<br>' . '<br>';
echo "3.チューニング" . '<br>';
echo "チューニングとは、IT業界においてはシステムやプログラムなどを改良し、
    パフォーマンスの向上を図ることをいう。
    性能の計測や実行状態の監視、問題点やボトルネックの特定、問題を緩和・回避
    するための設定や構成の変更などの一連作業からなる、" . '<br>' . '<br>';
?>