<?php
echo "＜IT用語　エンジニアになって困らないための基本用語＞" . '<br>' . '<br>';
echo "1.プルリクエスト（マージリクエスト）" . '<br>';
echo "プルリクエストとは、コードの変更をレビュワーに通知し、マージを
    依頼する機能のこと。コードのレビューを受けることで、一人で作ると
    気がつかないコードの指摘やバグや記述ミスの八卦ができ、コードの品質を
    高める。
    簡単にいうと、開発者のローカルリポジトリでの変更を他の開発者に通知する機能。
    " . '<br>' . '<br>';
echo "2.Git Flow" . '<br>';
echo "Git Flowとは、プラグイン（ツール）のこと。
    また、Gitの機能であるブランチを活用したGitの開発手法でもある。
    Git Flowでは、それぞれ役割が振られているmaster,relese,develop,
    feature,hot-fixの5つのブランチを使い分けて、開発を進めていきます。
    ・feature：開発を行うためのブランチで、ここの機能の実装やバグの解決を
              行う。
    ・develop：開発を行うためのブランチ。
    ・release：リリース前に準備、微調整を行うブランチ。
    ・master：リリースしたデータを置いておくブランチ。
    ・hot-fix：リリースされているデータに、緊急の修正対応をするための
              ブランチ。" . '<br>' . '<br>';
echo "3.CRON" . '<br>';
echo "CRONとは、UNIX系システムで使用されるジョブを自動実行する
    スケジューラのこと。ユーザーが設定したスケジュールに基づいて
    一定時間毎に指定したコマンド、シェルスクリプトやプログラムを自動実行
    させることができます。" . '<br>' . '<br>';
?>