1. CakePHPの2系・3系の違い<br>
<?php
    echo "CakePHP2系→CakePHP2、CakePHP3系→Cakephp3とします。
    まず見るべきページとしてCakePHP公式の移行ガイドがあります。
    モデルの変更、Composerと名前空間の利用、その他パフォーマンスの向上、
    セッション管理の改善、ビューセルの追加、TestShellの廃止などが違いです。"
    . '<br><br>';
    ?>
2. LAMP<br>
<?php
    echo "LAMPとは、オープンソースソフトウェアの組み合わせを指す言葉
    です。具体的にはOSのLinux、WebサーバーのApache、データベースのMySQL、
    プログラミングのPerl、PHP、Pythonを指します。LAMPとはこれらの頭文字を取ったものです。
    いずれも、データベース連動型で動的なコンテンツを含むWebサイトの構築に適しており、
    かつ人気の高いものです。OSたるLinuxのディストリビューションにおいては、
    これらLAMPがセットとなって配布されているものもあります。
    これらのソフトウェア群は、オープンソースソフトウェアであるためコストがかからないか、
    かかっても極めて低コストであるため、費用を軽減することができるとともに、
    高いカスタマイズ性を活かせるというメリットがあります。
    半面、保証、サポートがないなど、運用管理面でのリスクが大きく、
    開発者、運用管理者には相応のスキルが必要となります。". '<br><br>';
    ?>
3. AWS<br>
<?php
    echo "AWSとはアマゾンウェブサービスのことです。世界で最も包括的で広く採用されている
    クラウドプラットフォームです。世界中のデータセンターから175以上のフル機能のサービスを提供
    しています。急成長しているスタートアップ、大企業、主要な政府間など、何百ものクライアントが
    AWSを使用してコストを削減し、俊敏性を高め、イノベーションを加速させています。";
    ?>
