<?php
$one="1.仕様書";
$two="2.Git";
$three="3.マージツール";
?>
<?php echo $one; ?><br>
→仕様書とは、工業製品やソフトウェア、情報システム、サービスなどを開発
する際に、備えるべき機能やその性能、特性、満たすべき要件などを図表や
文章などで記述した文書。
何を作るべきかを明確にして開発者間で共有するために作成される。
情報システムの受託開発のように発注者との受注者が分かれている場合は、
金額や期間の算定根拠夜行書の前提条件ともなるため、両者間で齟齬がないように
入念に作り込んでいくことが多い。<br>
<?php echo $two; ?><br>
→便利なツールのアップデートが頻繁に行われているWEB業界委において、
Gitを活用して業務を効率化させることは一般的になってきています。
Gitを活用することで、チームでの作業効率を高めたり、多くのファイル
を管理することが簡単になります。
Gitとは、分散型バージョン管理システムです。
ざっくりいうとファイルのバージョン管理が簡単にできるツールと
いえます。基本的には、最新バージョンにアップデートしたりすると
古いバージョンに戻すことは難しいです。
しかし、Gitで管理しているファイルであれば、コンピュータ上で
ファイルの編集履歴を管理できるので、編集前のファイルを残したまま、
新しく編集したファイルを保存することができます。
なので古いバージョンから新しいバージョンまでの管理が簡単です。
Gitでできること。<br>
・古いバージョンに簡単に戻せる。<br>
・新旧のファイルを一元管理できる。<br>
・編集した履歴を複数人で共有できる。<br>
・複数人で修正した部分を一つに統合できる。<br>
<?php echo $three; ?><br>
→マージツールとは、FDLファイルまたはDTDファイルの変更内容を
MDLファイルにマージできるものを言います。マージツールには四つの
機能があります。<br>
（１）マージ機能<br>
（２）マップ機能<br>
（３）マッピング機能<br>
（４）フォーマット挿入機能<br>
※FDL：GNU Free Documentation Licenceの略。マニュアル、
教科書などの文書類の複製、再配布を自由にできるようにするために提唱
されたライセンス。FDLの各条項に従う限りにおいて、文書の変更、翻訳、
他の文書との結合、複数のFDL文書の集合体の作成などを行うことが
できる。<br>
※DTD：とは「文書型定義」のことで、SGMLやXMLの文書構造を定義する
スキーマ言語の一つ。<br>
※MDL：Material Definition Languageの略。<br>
※拡張子（filename extension）：ファイルの種別を識別するために
ファイルの名前（ファイル名）の末尾に付けられる文字列。<br>
