<?php
    echo "1.モジュール" . '<br>';
    echo "moduleとは、機能単位、交換可能な構成部分、寸法単位などを意味する英単語。様々な分野で聞かれる単語。
          IT関連の意味としては、プログラミングの１パーツであり、これだけでは機能しません。モジュールと他のモジュールを
          組み合わせてファイルとしてまとめ、さらにファイルを組み合わせていくことでプログラムが作られます。
          つまり、モジュールとは、プログラムの一部として組み込まれた時に初めて機能します。
          モジュール強度とは、モジュール内部にある機能の関連性の強さを表しています。
          具体的にいうと、モジュールが一つの機能だけを提供する「機能的強度」と呼び、最もモジュール強度が高い状態となります。
          一方、モジュール強度が低い状態とは「暗号的強度」で、機能間の関連性などを無視してまとめれたモジュールのことを指します。
          モジュールの結合度とは、モジュール同士がどれほどに結びつくのかを示しています。
          プログラミングにおいては、モジュールの結合度が低いほどいいとされています。
          つまり、モジュールの独立性が高いほど、よいプログラミングとなります。
          システム開発におけるプログラミングの部品であるモジュールですが、その一つ一つの内部の設定をすることを
          「モジュール設定」といいます。
          モジュールはパソコンで扱われるプログラムとは、モジュールを集めたプログラムとして機能させたものです。
          つまり「モジュール」とは、プログラムの要素であり、一番小さな単位です。それそのものでは機能しないものの、
          プログラムとしてまとめられることでその機能が実行されます。
          一方「プログラム」は、モジュールを組み合わせて作られていて、それ自体で実行することができます。
          さらに「ソフトウェア」は「プログラムの組み合わせ」であり、
          ソフトウェアとなった時に一般のPCユーザーが使うことができます。" . '<br>' . '<br>';
    echo "2.バージョン管理システム" . '<br>';
    echo "バージョン管理システムとは、ファイルの変更履歴の保存・管理を行うソフトウェアのこと。
          管理下のファイルについて、過去の版の参照や、複数の版の比較、差分の検出などを行うことができる。
    " . '<br>' . '<br>';
    echo "3.サブクエリ" . '<br>';
    echo "サブクエリとは、データベースなどの問い合わせ（クエリ）文の内部に含まれる、別の問い合わせ文のこと。
          サブクエリの結果を反映したクエリを実行することができる。";
?>