<?php
echo "＜IT用語　エンジニアになって困らないための基本用語＞" . '<br>';
echo "1.ハッシュ化" . '<br>';
echo "ある特定の文字列や数字の羅列を一定のルール（ハッシュ関数）に基づいた
    計算手順によって別の値（ハッシュ値）に置き換えさせることさします。
    暗号化との違いはハッシュ化した場合は、ハッシュ化作業を行なった人も含め
    て、誰も元に戻すことができない不可逆的な置き換えとなります。
    なので万が一盗まれても悪用されずに済みます。" . '<br>' . '<br>';
echo "2.総合テスト" . '<br>';
echo "システムテストとも呼ばれ、ソフトウェアおよびシステムの検証手法の
    一つです。構築したシステムが全体で予定通りの機能を満たしているか、
    また機能や性能が仕様書通りに構築できているかを検証することができます。
    単体テスト、結合テストの実行後に、本番とほぼ同じ環境でテストを実施しま
    す。" . '<br>' . '<br>';
echo "3.デバッグ" . '<br>';
echo "コンピュータのプログラムの誤りを見つけ、手直しをすること。
    バグと呼ばれるプログラムや関数の間違いを見つけ、それらを廃城する作業
    のことです。バグフィックスと呼ばれることもあります。最近では、排除・修正の作業だけに
    とどまらず、バグについての理解を深め、同じ間違いが起きないように対策
    する一連のプロセスをまとめてデバッグということもあります。実際の業務では、
    プログラムのテスト検証を実施するテスターが、デバッガと呼ばれる支援ツール
    を使用死バグ発見の作業を行うことが多いです。   " . '<br>' . '<br>';
?>